openthread/openthread/third_party/ti/devices/cc26x0/inc/hw_event.h
// Output Selection for RFC Event 1
#define EVENT_O_RFCSEL1                                             0x00000104

// Output Selection for RFC Event 2
#define EVENT_O_RFCSEL2                                             0x00000108

// Output Selection for RFC Event 3
#define EVENT_O_RFCSEL3                                             0x0000010C

// Output Selection for RFC Event 4
#define EVENT_O_RFCSEL4                                             0x00000110

// Output Selection for RFC Event 5
#define EVENT_O_RFCSEL5                                             0x00000114

// Output Selection for RFC Event 6
#define EVENT_O_RFCSEL6                                             0x00000118

// Output Selection for RFC Event 7
#define EVENT_O_RFCSEL7                                             0x0000011C

// Output Selection for RFC Event 8
#define EVENT_O_RFCSEL8                                             0x00000120

// Output Selection for RFC Event 9
#define EVENT_O_RFCSEL9                                             0x00000124

// Output Selection for GPT0 0
#define EVENT_O_GPT0ACAPTSEL                                        0x00000200

// Output Selection for GPT0 1
#define EVENT_O_GPT0BCAPTSEL                                        0x00000204

// Output Selection for GPT1 0
#define EVENT_O_GPT1ACAPTSEL                                        0x00000300

// Output Selection for GPT1 1
#define EVENT_O_GPT1BCAPTSEL                                        0x00000304

// Output Selection for GPT2 0
#define EVENT_O_GPT2ACAPTSEL                                        0x00000400

// Output Selection for GPT2 1
#define EVENT_O_GPT2BCAPTSEL                                        0x00000404

// Output Selection for DMA Channel 1 SREQ
#define EVENT_O_UDMACH1SSEL                                         0x00000508

// Output Selection for DMA Channel 1 REQ
#define EVENT_O_UDMACH1BSEL                                         0x0000050C

// Output Selection for DMA Channel 2 SREQ
#define EVENT_O_UDMACH2SSEL                                         0x00000510

// Output Selection for DMA Channel 2 REQ
#define EVENT_O_UDMACH2BSEL                                         0x00000514

// Output Selection for DMA Channel 3 SREQ
#define EVENT_O_UDMACH3SSEL                                         0x00000518

// Output Selection for DMA Channel 3 REQ
#define EVENT_O_UDMACH3BSEL                                         0x0000051C

// Output Selection for DMA Channel 4 SREQ
#define EVENT_O_UDMACH4SSEL                                         0x00000520

// Output Selection for DMA Channel 4 REQ
#define EVENT_O_UDMACH4BSEL                                         0x00000524

// Output Selection for DMA Channel 5 SREQ
#define EVENT_O_UDMACH5SSEL                                         0x00000528

// Output Selection for DMA Channel 5 REQ
#define EVENT_O_UDMACH5BSEL                                         0x0000052C

// Output Selection for DMA Channel 6 SREQ
#define EVENT_O_UDMACH6SSEL                                         0x00000530

// Output Selection for DMA Channel 6 REQ
#define EVENT_O_UDMACH6BSEL                                         0x00000534

// Output Selection for DMA Channel 7 SREQ
#define EVENT_O_UDMACH7SSEL                                         0x00000538

// Output Selection for DMA Channel 7 REQ
#define EVENT_O_UDMACH7BSEL                                         0x0000053C

// Output Selection for DMA Channel 8 SREQ
#define EVENT_O_UDMACH8SSEL                                         0x00000540

// Output Selection for DMA Channel 8 REQ
#define EVENT_O_UDMACH8BSEL                                         0x00000544

// Output Selection for DMA Channel 9 SREQ
#define EVENT_O_UDMACH9SSEL                                         0x00000548

// Output Selection for DMA Channel 9 REQ
#define EVENT_O_UDMACH9BSEL                                         0x0000054C

// Output Selection for DMA Channel 10 SREQ
#define EVENT_O_UDMACH10SSEL                                        0x00000550

// Output Selection for DMA Channel 10 REQ
#define EVENT_O_UDMACH10BSEL                                        0x00000554

// Output Selection for DMA Channel 11 SREQ
#define EVENT_O_UDMACH11SSEL                                        0x00000558

// Output Selection for DMA Channel 11 REQ
#define EVENT_O_UDMACH11BSEL                                        0x0000055C

// Output Selection for DMA Channel 12 SREQ
#define EVENT_O_UDMACH12SSEL                                        0x00000560

// Output Selection for DMA Channel 12 REQ
#define EVENT_O_UDMACH12BSEL                                        0x00000564

// Output Selection for DMA Channel 13 REQ
#define EVENT_O_UDMACH13BSEL                                        0x0000056C

// Output Selection for DMA Channel 14 REQ
#define EVENT_O_UDMACH14BSEL                                        0x00000574

// Output Selection for DMA Channel 15 REQ
#define EVENT_O_UDMACH15BSEL                                        0x0000057C

// Output Selection for DMA Channel 16 SREQ
#define EVENT_O_UDMACH16SSEL                                        0x00000580

// Output Selection for DMA Channel 16 REQ
#define EVENT_O_UDMACH16BSEL                                        0x00000584

// Output Selection for DMA Channel 17 SREQ
#define EVENT_O_UDMACH17SSEL                                        0x00000588

// Output Selection for DMA Channel 17 REQ
#define EVENT_O_UDMACH17BSEL                                        0x0000058C

// Output Selection for DMA Channel 21 SREQ
#define EVENT_O_UDMACH21SSEL                                        0x000005A8

// Output Selection for DMA Channel 21 REQ
#define EVENT_O_UDMACH21BSEL                                        0x000005AC

// Output Selection for DMA Channel 22 SREQ
#define EVENT_O_UDMACH22SSEL                                        0x000005B0

// Output Selection for DMA Channel 22 REQ
#define EVENT_O_UDMACH22BSEL                                        0x000005B4

// Output Selection for DMA Channel 23 SREQ
#define EVENT_O_UDMACH23SSEL                                        0x000005B8

// Output Selection for DMA Channel 23 REQ
#define EVENT_O_UDMACH23BSEL                                        0x000005BC

// Output Selection for DMA Channel 24 SREQ
#define EVENT_O_UDMACH24SSEL                                        0x000005C0

// Output Selection for DMA Channel 24 REQ
#define EVENT_O_UDMACH24BSEL                                        0x000005C4

// Output Selection for GPT3 0
#define EVENT_O_GPT3ACAPTSEL                                        0x00000600

